Repository: Markus-web/Property-Spotlight
Catalog: languages/property-spotlight-*.po
Languages: fi

source: Settings
fi: Asetukset

source: Listings
fi: Kohteet

source: Style
fi: Tyyli

source: Documentation
fi: Ohjeet

source: Property Spotlight:
fi: Näyteikkuna:

source: API credentials need to be configured.
fi: API-tunnukset tulee määrittää.

source: Configure now
fi: Määritä nyt

source: Property Spotlight
fi: Näyteikkuna

source: Select and order the property listings you want to feature on your website.
fi: Valitse ja järjestä kohteet, jotka haluat nostaa esille sivustollasi.

source: API Settings
fi: API-asetukset

source: Configure Linear.fi API credentials to fetch listings. If the official Linear plugin is installed, this plugin can use those credentials automatically. You can also configure separate credentials here.
fi: Määritä Linear.fi API-tunnukset kohteiden hakemiseen. Jos virallinen Linear-lisäosa on asennettuna, tämä lisäosa voi käyttää näitä tunnuksia automaattisesti. Voit myös määrittää erilliset tunnukset tässä.

source: Using official Linear plugin credentials.
fi: Käyttää virallisen Linear-lisäosan tunnuksia.

source: No separate configuration needed. You can optionally configure your own credentials below.
fi: Erillistä määritystä ei tarvita. Voit halutessasi määrittää omat tunnukset alla.

source: Currently using credentials from the official Linear plugin.
fi: Käyttää tällä hetkellä virallisen Linear-lisäosan tunnuksia.

source: You can optionally configure separate credentials below.
fi: Voit halutessasi määrittää erilliset tunnukset alla.

source: API credentials required.
fi: API-tunnukset vaaditaan.

source: Configure API credentials below, or set up the official Linear plugin first.
fi: Määritä API-tunnukset alla tai aseta virallinen Linear-lisäosa ensin.

source: API credentials are required to fetch listings from Linear.fi.
fi: API-tunnukset vaaditaan kohteiden hakemiseen Linear.fi:stä.

source: Using custom API credentials.
fi: Käyttää mukautettuja API-tunnuksia.

source: Settings are independent from the official Linear plugin.
fi: Asetukset ovat riippumattomia virallisesta Linear-lisäosasta.

source: Using custom credentials configured below.
fi: Käyttää alla määritettyjä mukautettuja tunnuksia.

source: Using official plugin setting
fi: Käyttää virallisen lisäosan asetusta

source: Linear API data endpoint URL. Default: https://data.linear.fi. Only change if using a test or custom endpoint.
fi: Linear API:n data-osoite. Oletus: https://data.linear.fi. Muuta vain, jos käytät testi- tai mukautettua osoitetta.

source: Linear API data endpoint URL.
fi: Linear API:n data-osoite.

source: Client Secret
fi: Asiakassalaisuus

source: Your Linear API client secret key.
fi: Linear API:n asiakassalaisuusavain.

source: Save API Settings
fi: Tallenna API-asetukset

source: Clear (Use Official Plugin)
fi: Tyhjennä (käytä virallista lisäosaa)

source: Clear Cache
fi: Tyhjennä välimuisti

source: Use if listings aren't updating or after making changes.
fi: Käytä, jos kohteet eivät päivity tai olet tehnyt muutoksia.

source: API Key
fi: API-avain

source: Your Linear API key (include the LINEAR-API-KEY prefix). Obtain from your Linear.fi account or support documentation. Keep this secure.
fi: Linear API-avain (sisällytä LINEAR-API-KEY-etuliite). Hanki Linear.fi-tilistäsi tai tukidokumentaatiosta. Pidä turvassa.

source: Your Linear API key (include the LINEAR-API-KEY prefix).
fi: Linear API-avaimesi (sisällytä LINEAR-API-KEY-etuliite).

source: Add Featured Listing
fi: Lisää nostettava kohde

source: Add listings to your featured list. Search from available listings or enter a listing ID manually.
fi: Lisää kohteita nostettujen listalle. Hae saatavilla olevista kohteista tai syötä kohteen tunnus manuaalisesti.

source: Search and select from available listings:
fi: Hae ja valitse saatavilla olevista kohteista:

source: Select from available listings:
fi: Valitse saatavilla olevista kohteista:

source: Search listings...
fi: Hae kohteita...

source: OR
fi: TAI

source: Or enter listing ID manually:
fi: Tai syötä kohteen tunnus manuaalisesti:

source: Enter listing ID manually:
fi: Syötä kohteen tunnus manuaalisesti:

source: e.g., ABC123
fi: esim. ABC123

source: Add
fi: Lisää

source: Featured Listings
fi: Nostetut kohteet

source: Drag listings to reorder. The order here determines how they appear on your website.
fi: Vedä kohteita järjestääksesi. Järjestys määrittää, miten ne näkyvät sivustollasi.

source: Drag to reorder. The order here determines display order on the frontend.
fi: Vedä järjestääksesi. Järjestys määrittää näyttöjärjestyksen sivustolla.

source: No featured listings yet. Use the options above to add your first listing.
fi: Nostettuja kohteita ei ole vielä. Käytä yllä olevia vaihtoehtoja lisätäksesi ensimmäisen kohteen.

source: No featured listings selected. Use the options above to add listings.
fi: Nostettuja kohteita ei ole valittu. Käytä yllä olevia vaihtoehtoja lisätäksesi kohteita.

source: Save Changes
fi: Tallenna muutokset

source: Changes take effect immediately after saving.
fi: Muutokset tulevat voimaan heti tallennuksen jälkeen.

source: Style Settings
fi: Tyylin asetukset

source: Customize the appearance of your listings. Colors are applied globally via CSS variables. Use presets for quick styling or customize individual colors.
fi: Muokkaa kohteiden ulkoasua. Värit määritetään globaalisti CSS-muuttujien kautta. Käytä esiasetuksia nopeaan tyylittelyyn tai muokkaa yksittäisiä värejä.

source: Primary Color
fi: Pääväri

source: Text and headings color. Use dark colors for light backgrounds, light colors for dark themes.
fi: Tekstin ja otsikoiden väri. Käytä tummia värejä vaaleille taustoille, vaaleita värejä tummille teemoille.

source: Accent Color
fi: Korostusväri

source: Links and hover states. Should complement your primary color and provide visual contrast.
fi: Linkkien ja hover-tilojen väri. Täydentää pääväriäsi ja tarjoaa visuaalista kontrastia.

source: Price Color
fi: Hinnan väri

source: Price text color. Use a bold or contrasting color to make prices stand out.
fi: Hintatekstin väri. Käytä rohkeaa tai kontrastista väriä korostaaksesi hintoja.

source: Featured Background
fi: Nostetun tausta

source: Background for "featured" style cards (NÄYTEIKKUNA). Only visible when using style="featured" in shortcodes. Choose a vibrant color that contrasts with white text.
fi: "Nostettu"-tyylin korttien taustaväri (NÄYTEIKKUNA). Näkyy vain, kun käytät style="featured" lyhytkoodeissa. Valitse eloisa väri, joka kontrastoi valkoisen tekstin kanssa.

source: Border Radius
fi: Reunan pyöristys

source: Card corner roundness. Range: 0px (sharp) to 24px (very rounded). Lower values (0-6px) for professional, higher (16-24px) for softer look.
fi: Kortin kulmien pyöreys. Alue: 0px (terävä) - 24px (hyvin pyöristetty). Alhaiset arvot (0-6px) ammattimaiselle, korkeat (16-24px) pehmeämmälle ulkoasulle.

source: Presets
fi: Esiasetukset

source: Pre-configured color schemes inspired by popular Finnish property websites. You can customize individual colors after applying a preset.
fi: Esivalmistellut värimallinnukset, jotka on inspiroitu suosituista suomalaisista kiinteistösivustoista. Voit muokata yksittäisiä värejä esiasetuksen soveltamisen jälkeen.

source: Minimal
fi: Minimaalinen

source: Reset to Default
fi: Palauta oletukset

source: Save Style Settings
fi: Tallenna tyylin asetukset

source: API settings required.
fi: API-asetukset vaaditaan.

source: Configure API settings in the Settings tab to start selecting featured listings.
fi: Määritä API-asetukset Asetukset-välilehdessä aloittaaksesi nostettujen kohteiden valitsemisen.

source: Configure API settings above to start selecting featured listings.
fi: Määritä yllä olevat API-asetukset aloittaaksesi nostettujen kohteiden valitsemisen.

source: Usage
fi: Käyttö

source: Shortcode
fi: Lyhytkoodi

source: Use the shortcode to display featured listings anywhere on your site.
fi: Käytä lyhytkoodia näyttääksesi nostetut kohteet missä tahansa sivustollasi.

source: Shortcode Attributes
fi: Lyhytkoodin attribuutit

source: Shortcode Options
fi: Lyhytkoodin asetukset

source: Attribute
fi: Attribuutti

source: Description
fi: Kuvaus

source: Default
fi: Oletus

source: Values
fi: Arvot

source: Maximum number of listings to display
fi: Näytettävien kohteiden enimmäismäärä

source: Any number (1, 2, 3...)
fi: Mikä tahansa numero (1, 2, 3...)

source: Display layout style
fi: Näyttöasettelun tyyli

source: Card design style (Nettiauto-inspired)
fi: Kortin muotoilutyyli (Nettiauto-inspiroitu)

source: Section header title (e.g., "NÄYTEIKKUNA")
fi: Osion otsikko (esim. "NÄYTEIKKUNA")

source: Any text
fi: Mikä tahansa teksti

source: Additional CSS class for styling
fi: Lisä CSS-luokka muotoiluun

source: Any CSS class name
fi: Mikä tahansa CSS-luokan nimi

source: Show or hide the price
fi: Näytä tai piilota hinta

source: Show or hide the address
fi: Näytä tai piilota osoite

source: Show or hide the listing image
fi: Näytä tai piilota kohteen kuva

source: Show or hide the city/location
fi: Näytä tai piilota kaupunki/sijainti

source: Show or hide property details (type, rooms, area)
fi: Näytä tai piilota kohteen tiedot (tyyppi, huoneet, pinta-ala)

source: Language for listing content
fi: Kohteen sisällön kieli

source: Auto-detected
fi: Automaattinen

source: Basic Examples
fi: Perusesimerkit

source: Show all featured listings in a 3-column grid:
fi: Näytä kaikki nostetut kohteet 3-sarakkeisena ruudukkona:

source: All
fi: Kaikki

source: Display layout: grid, list, or carousel
fi: Näyttöasettelu: ruudukko, lista tai karuselli

source: Number of columns (grid layout only)
fi: Sarakkeiden määrä (vain ruudukkoasettelu)

source: Examples
fi: Esimerkit

source: Show first 3 listings:
fi: Näytä ensimmäiset 3 kohdetta:

source: Show listings in a 2-column grid:
fi: Näytä kohteet 2-sarakkeisena ruudukkona:

source: Show listings as a vertical list:
fi: Näytä kohteet pystylistana:

source: Show listings in a carousel/slider:
fi: Näytä kohteet karusellissa/liukusäätimessä:

source: Nettiauto-Style Examples
fi: Nettiauto-tyyliset esimerkit

source: NÄYTEIKKUNA - Featured style with red overlay (like Nettiauto):
fi: NÄYTEIKKUNA - Nostettu tyyli punaisella päällyksellä (kuten Nettiauto):

source: NÄYTEIKKUNA - Showcase style with white cards:
fi: NÄYTEIKKUNA - Näyteikkunatyyli valkoisilla korteilla:

source: Compact cards for smaller spaces:
fi: Kompaktit kortit pienempiin tiloihin:

source: Dark theme for dark backgrounds:
fi: Tumma teema tummille taustoille:

source: Advanced Examples
fi: Edistyneet esimerkit

source: Homepage hero section - 3 featured properties:
fi: Etusivun pääosio - 3 nostettua kohdetta:

source: Sidebar widget - compact list:
fi: Sivupalkin vimpain - kompakti lista:

source: Full-width carousel:
fi: Koko leveyden karuselli:

source: Mobile-friendly 1-column layout:
fi: Mobiiliystävällinen 1-sarakkeen asettelu:

source: Minimal display (address only):
fi: Minimaalinen näyttö (vain osoite):

source: Gutenberg Block
fi: Gutenberg-lohko

source: For the block editor, search for "Property Spotlight" in the block inserter. The block provides a visual interface with the same options as the shortcode.
fi: Etsi lohkoeditorissa "Näyteikkuna" lohkovalitsimesta. Lohko tarjoaa visuaalisen käyttöliittymän samoilla asetuksilla kuin lyhytkoodi.

source: PHP Template Usage
fi: PHP-mallien käyttö

source: To use in theme templates, use the do_shortcode function:
fi: Käyttääksesi teeman malleissa, käytä do_shortcode-funktiota:

source: CSS Customization
fi: CSS-muokkaus

source: The plugin uses these CSS classes for styling:
fi: Lisäosa käyttää näitä CSS-luokkia muotoiluun:

source: Class
fi: Luokka

source: Main container
fi: Pääsäiliö

source: Grid layout modifier
fi: Ruudukkoasettelun muokkain

source: List layout modifier
fi: Lista-asettelun muokkain

source: Carousel layout modifier
fi: Karuselliasettelun muokkain

source: Individual listing card
fi: Yksittäinen kohdekortti

source: Listing image container
fi: Kohteen kuvasäiliö

source: Listing content area
fi: Kohteen sisältöalue

source: Listing title/address
fi: Kohteen otsikko/osoite

source: Price display
fi: Hintanäyttö

source: Location info
fi: Sijaintitiedot

source: Property details (rooms, area, etc.)
fi: Kohteen tiedot (huoneet, pinta-ala jne.)

source: Search for "Property Spotlight" in the block inserter.
fi: Etsi "Näyteikkuna" lohkovalitsimesta.

source: Permission denied
fi: Käyttö estetty

source: Settings saved
fi: Asetukset tallennettu

source: API settings saved
fi: API-asetukset tallennettu

source: API credentials not configured
fi: API-tunnuksia ei ole määritetty

source: API returned status %d
fi: API palautti tilan %d

source: Invalid API response
fi: Virheellinen API-vastaus

source: No featured listings found.
fi: Nostettuja kohteita ei löytynyt.

source: rooms
fi: huonetta

source: View listing
fi: Näytä kohde

source: Previous
fi: Edellinen

source: Next
fi: Seuraava

source: Display featured Linear.fi property listings
fi: Näytä nostetut Linear.fi-kohteet

source: Limit
fi: Raja

source: Layout
fi: Asettelu

source: Grid
fi: Ruudukko

source: List
fi: Lista

source: Carousel
fi: Karuselli

source: Columns
fi: Sarakkeet

source: Saving...
fi: Tallennetaan...

source: Saved!
fi: Tallennettu!

source: Error saving settings
fi: Virhe asetusten tallentamisessa

source: Loading listings...
fi: Ladataan kohteita...

source: No listings found
fi: Kohteita ei löytynyt

source: Search listings by address or ID...
fi: Hae kohteita osoitteen tai tunnuksen perusteella...

source: Remove this listing from featured?
fi: Poistetaanko kohde nostetuista?

source: Are you sure you want to clear custom credentials?
fi: Haluatko varmasti tyhjentää mukautetut tunnukset?

source: Cache cleared
fi: Välimuisti tyhjennetty

source: Style settings saved
fi: Tyylin asetukset tallennettu

source: Display featured property listings
fi: Näytä nostetut kohteet

source: Display Settings
fi: Näyttöasetukset

source: 0 = show all featured listings
fi: 0 = näytä kaikki nostetut kohteet

source: Error loading listings
fi: Virhe kohteiden latauksessa

source: Unknown address
fi: Tuntematon osoite

source: No featured listings selected. Go to Property Spotlight settings to select listings.
fi: Nostettuja kohteita ei ole valittu. Siirry Näyteikkuna-asetuksiin valitaksesi kohteita.

source: Automation Settings
fi: Automaatioasetukset

source: Automatically manage your featured listings: remove outdated ones, hide sold properties, and track user engagement.
fi: Hallitse nostettuja kohteita automaattisesti: poista vanhentuneet, piilota myydyt kiinteistöt ja seuraa käyttäjien kiinnostusta.

source: Auto-expire after
fi: Vanhene automaattisesti

source: days
fi: päivän jälkeen

source: Automatically remove listings from featured after this many days. Set to 0 to disable. Common: 30 days for monthly rotation.
fi: Poista kohteet automaattisesti nostetuista tämän päivämäärän jälkeen. Aseta 0 poistaaksesi käytöstä. Yleinen: 30 päivää kuukausittaiselle kierrolle.

source: Automatically remove listings from featured after this many days. Set to 0 to disable.
fi: Poista kohteet automaattisesti nostetuista tämän päivämäärän jälkeen. Aseta 0 poistaaksesi käytöstä.

source: Sold Listings
fi: Myydyt kohteet

source: Automatically hide sold/rented listings
fi: Piilota myydyt/vuokratut kohteet automaattisesti

source: Listings with status "sold" or "rented" will not be displayed. Checks status from API automatically.
fi: Kohteet, joiden tila on "myyty" tai "vuokrattu", eivät näy. Tarkistaa tilan API:sta automaattisesti.

source: Listings with status "sold" or "rented" will not be displayed.
fi: Kohteet, joiden tila on "myyty" tai "vuokrattu", eivät näy.

source: Analytics
fi: Analytiikka

source: Enable click and impression tracking
fi: Ota käyttöön klikkausten ja näyttökertojen seuranta

source: Fires events to Google Analytics 4, GTM, and Matomo when listings are viewed or clicked. Tracks listing ID, address, and position.
fi: Lähettää tapahtumat Google Analytics 4:ään, GTM:ään ja Matomoon, kun kohteita katsotaan tai klikataan. Seuraa kohteen ID:tä, osoitetta ja sijaintia.

source: Fires events to Google Analytics 4, GTM, and Matomo when listings are viewed or clicked.
fi: Lähettää tapahtumat Google Analytics 4:ään, GTM:ään ja Matomoon kun kohteita katsotaan tai klikataan.

source: Save Automation Settings
fi: Tallenna automaatioasetukset

source: Import / Export
fi: Tuo / Vie

source: Backup your featured listings configuration or transfer to another site. Export includes all settings: featured listings, API credentials, style settings, and automation preferences (JSON format).
fi: Varmuuskopioi nostettujen kohteiden asetukset tai siirrä toiselle sivustolle. Vienti sisältää kaikki asetukset: nostetut kohteet, API-tunnukset, tyylin asetukset ja automaatioasetukset (JSON-muoto).

source: Backup your featured listings configuration or transfer to another site.
fi: Varmuuskopioi nostettujen kohteiden asetukset tai siirrä toiselle sivustolle.

source: Export Settings
fi: Vie asetukset

source: Download a JSON file with all settings. Use before major changes or site migrations.
fi: Lataa JSON-tiedosto kaikilla asetuksilla. Käytä ennen suuria muutoksia tai sivuston siirtoja.

source: Download a JSON file with all settings.
fi: Lataa JSON-tiedosto kaikilla asetuksilla.

source: Import Settings
fi: Tuo asetukset

source: Upload a previously exported JSON file. This will replace all current settings. Export a backup first if needed.
fi: Lataa aiemmin viety JSON-tiedosto. Tämä korvaa kaikki nykyiset asetukset. Vie varmuuskopio ensin tarvittaessa.

source: Upload a previously exported JSON file.
fi: Lataa aiemmin viety JSON-tiedosto.

source: Automation settings saved
fi: Automaatioasetukset tallennettu

source: No data provided
fi: Tietoja ei annettu

source: Invalid JSON format
fi: Virheellinen JSON-muoto

source: Invalid settings format
fi: Virheellinen asetusten muoto

source: Settings imported successfully from version %s
fi: Asetukset tuotu onnistuneesti versiosta %s

source: Exporting...
fi: Viedään...

source: Settings exported
fi: Asetukset viety

source: Importing...
fi: Tuodaan...

source: Start
fi: Alku

source: End
fi: Loppu

source: Active
fi: Aktiivinen

source: Scheduled
fi: Ajastettu

source: Expired
fi: Vanhentunut

source: Quick Start
fi: Pika-aloitus

source: Get up and running in three simple steps:
fi: Aloita kolmessa yksinkertaisessa vaiheessa:

source: Configure your API settings in the
fi: Määritä API-asetukset

source: tab above
fi: välilehdellä yllä

source: Add featured listings in the
fi: Lisää nostettuja kohteita

source: tab
fi: välilehdellä

source: Use the shortcode below to display listings anywhere on your site
fi: Käytä alla olevaa lyhytkoodia näyttääksesi kohteet missä tahansa sivustollasi

source: Most common use case:
fi: Yleisin käyttötapaus:

source: This displays your first 3 featured listings in a responsive 3-column grid - perfect for homepage hero sections.
fi: Tämä näyttää kolme ensimmäistä nostettua kohdetta responsiivisessa 3-sarakkeisessa ruudukossa - täydellinen etusivun pääosioon.

source: Property Spotlight offers multiple ways to display your featured listings. Choose the method that best fits your workflow:
fi: Näyteikkuna tarjoaa useita tapoja näyttää nostetut kohteet. Valitse työskentelytapasi mukaiseksi sopivin menetelmä:

source: The shortcode is the most flexible method. Simply paste it into any post, page, or widget area. Works with both the Classic and Block editors.
fi: Lyhytkoodi on joustavin menetelmä. Liitä se mihin tahansa artikkeliin, sivuun tai vimpainalueeseen. Toimii sekä perinteisessä että lohkoeditorissa.

source: This basic shortcode displays all your featured listings in the default 3-column grid layout.
fi: Tämä peruslyhytkoodi näyttää kaikki nostetut kohteet oletusarvoisessa 3-sarakkeisessa ruudukossa.

source: Customize the appearance and behavior of your listings with these attributes. All attributes are optional.
fi: Muokkaa kohteiden ulkoasua ja toimintaa näillä attribuuteilla. Kaikki attribuutit ovat valinnaisia.

source: Control how many listings appear. Useful for homepage hero sections or limiting sidebar widgets. Leave empty to show all featured listings.
fi: Hallitse näytettävien kohteiden määrää. Hyödyllinen etusivun pääosioihin tai sivupalkin vimpainten rajoittamiseen. Jätä tyhjäksi näyttääksesi kaikki nostetut kohteet.

source: Choose how listings are arranged: grid for card layouts, list for vertical stacking, or carousel for interactive sliders.
fi: Valitse kohteiden järjestelytapa: ruudukko korttiasetteluun, lista pystysuuntaiseen pinoamiseen tai karuselli interaktiivisiin liukusäätimeen.

source: Match your site's design with pre-built styles inspired by popular Finnish property sites. Featured style adds a colored overlay badge.
fi: Sovita sivustosi design valmiilla tyyleillä, jotka on inspiroitu suosituista suomalaisista kiinteistösivustoista. Nostettu-tyyli lisää värillisen päällyksen merkin.

source: Number of columns in grid layout. Responsive: automatically adjusts on mobile devices. Use 1 column for mobile-first designs.
fi: Sarakkeiden määrä ruudukkoasettelussa. Responsiivinen: sopeutuu automaattisesti mobiililaitteilla. Käytä 1 saraketta mobiili-ensimmäisiin suunnitteluihin.

source: Add a section header above your listings. Perfect for sections like "NÄYTEIKKUNA" or "Featured Properties".
fi: Lisää osion otsikko kohteiden yläpuolelle. Täydellinen osioille kuten "NÄYTEIKKUNA" tai "Nostetut kohteet".

source: Add custom CSS classes for advanced styling. Useful for theme integration or custom design requirements.
fi: Lisää mukautettuja CSS-luokkia edistyneeseen muotoiluun. Hyödyllinen teeman integrointiin tai mukautettuihin suunnitteluvaatimuksiin.

source: Toggle price display. Set to false for teaser sections or when price information is displayed elsewhere.
fi: Vaihda hinnan näyttö. Aseta false-teaser-osiossa tai kun hintatiedot näytetään muualla.

source: Toggle address display. Useful for compact layouts where space is limited.
fi: Vaihda osoitteen näyttö. Hyödyllinen kompakteissa asetteluissa, joissa tilaa on rajoitetusti.

source: Toggle listing images. Hide images for text-only layouts or sidebar widgets with limited space.
fi: Vaihda kohteen kuvien näyttö. Piilota kuvat tekstipainotteisissa asetteluissa tai sivupalkin vimpainten rajoitetussa tilassa.

source: Toggle city/location display. Useful when location is already clear from context or page title.
fi: Vaihda kaupungin/sijainnin näyttö. Hyödyllinen, kun sijainti on jo selvä kontekstista tai sivun otsikosta.

source: Toggle property details (type, rooms, area). Hide for minimal designs or when details are shown elsewhere on the page.
fi: Vaihda kohteen tietojen näyttö (tyyppi, huoneet, pinta-ala). Piilota minimaalisissa suunnitteluissa tai kun tiedot näytetään muualla sivulla.

source: Override automatic language detection. Use when you need listings in a specific language regardless of site language.
fi: Ohita automaattinen kielitunnistus. Käytä, kun tarvitset kohteet tietyllä kielellä riippumatta sivuston kielestä.

source: Common Examples
fi: Yleiset esimerkit

source: These examples cover the most common use cases. Copy and paste into your posts, pages, or widgets.
fi: Nämä esimerkit kattavat yleisimmät käyttötapaukset. Kopioi ja liitä artikkeleihin, sivuihin tai vimpaineisiin.

source: Default display - All listings in 3-column grid:
fi: Oletusnäyttö - Kaikki kohteet 3-sarakkeisessa ruudukossa:

source: Perfect starting point. Shows all your featured listings in a responsive grid.
fi: Täydellinen lähtökohta. Näyttää kaikki nostetut kohteet responsiivisessa ruudukossa.

source: Homepage hero - 3 featured properties:
fi: Etusivun pääosio - 3 nostettua kohdetta:
