Repository: Markus-web/Property-Spotlight
Catalog: languages/property-spotlight-*.po
Languages: fi

source: Ideal for homepage hero sections. Displays exactly 3 listings in a clean grid.
fi: Ihanteellinen etusivun pääosioihin. Näyttää tasan 3 kohdetta siistissä ruudukossa.

source: 2-column layout:
fi: 2-sarakkeinen asettelu:

source: Wider cards, perfect for content areas with more horizontal space.
fi: Leveämmät kortit, täydellinen sisältöalueille, joissa on enemmän vaakasuuntaista tilaa.

source: Vertical list layout:
fi: Pystylista-asettelu:

source: Stack listings vertically. Great for sidebars or narrow content areas.
fi: Pinota kohteet pystysuunnassa. Loistava sivupalkkeihin tai kapeisiin sisältöalueisiin.

source: Carousel slider:
fi: Karuselli-liukusäädin:

source: Interactive slider with navigation. Best for showcasing multiple listings in limited space.
fi: Interaktiivinen liukusäädin navigoinnilla. Paras useiden kohteiden esittelyyn rajoitetussa tilassa.

source: Finnish Property Site Styles
fi: Suomalaisten kiinteistösivustojen tyylit

source: Pre-built styles inspired by popular Finnish property websites. Perfect for matching your site's design language.
fi: Valmiit tyylit, jotka on inspiroitu suosituista suomalaisista kiinteistösivustoista. Täydellinen sivustosi suunnittelukielen vastaamiseen.

source: NÄYTEIKKUNA - Featured style with colored badge:
fi: NÄYTEIKKUNA - Nostettu tyyli värillisellä merkillä:

source: Nettiauto-inspired style with a prominent colored overlay badge. Perfect for highlighting premium listings.
fi: Nettiauto-inspiroitu tyyli näkyvällä värillisellä päällyksen merkillä. Täydellinen premium-kohteiden korostamiseen.

source: NÄYTEIKKUNA - Clean showcase style:
fi: NÄYTEIKKUNA - Siisti näyteikkunatyyli:

source: White cards with clean design. Professional look suitable for any property type.
fi: Valkoiset kortit siistillä suunnittelulla. Ammattimainen ulkoasu, joka sopii mihin tahansa kiinteistötyyppiin.

source: Compact cards - 4 columns:
fi: Kompaktit kortit - 4 saraketta:

source: Smaller cards in a 4-column grid. Maximizes listings shown in limited vertical space.
fi: Pienemmät kortit 4-sarakkeisessa ruudukossa. Maksimoi näytettävien kohteiden määrän rajoitetussa pystysuuntaisessa tilassa.

source: Dark theme:
fi: Tumma teema:

source: Dark cards with light text. Ideal for dark backgrounds or modern design aesthetics.
fi: Tummat kortit vaalealla tekstillä. Ihanteellinen tummille taustoille tai modernille suunnitteluaestetiikalle.

source: Real-World Use Cases
fi: Käytännön käyttötapaukset

source: Practical examples for specific page locations and design requirements.
fi: Käytännön esimerkit tietyille sivun sijainneille ja suunnitteluvaatimuksille.

source: Homepage hero section:
fi: Etusivun pääosio:

source: Full-width section with custom styling. Add your own CSS class for theme integration.
fi: Koko leveyden osio mukautetulla muotoilulla. Lisää oma CSS-luokkasi teeman integrointia varten.

source: Sidebar widget:
fi: Sivupalkin vimpain:

source: Compact text-only list perfect for narrow sidebars. Images hidden to save space.
fi: Kompakti tekstipainotteinen lista, täydellinen kapeisiin sivupalkkeihin. Kuvat piilotettu tilan säästämiseksi.

source: Full-width carousel banner:
fi: Koko leveyden karuselli-banneri:

source: Interactive slider spanning full page width. Great for above-the-fold content.
fi: Interaktiivinen liukusäädin, joka ulottuu koko sivun leveydelle. Loistava yläosan sisällölle.

source: Mobile-optimized single column:
fi: Mobiilioptimoitu yksisarakkeinen:

source: Single column layout that works perfectly on all screen sizes. No responsive breakpoints needed.
fi: Yksisarakkeinen asettelu, joka toimii täydellisesti kaikilla näyttökooilla. Responsiivisia katkaisupisteitä ei tarvita.

source: Minimal text-only list:
fi: Minimaalinen tekstipainotteinen lista:

source: Ultra-compact display showing only addresses. Perfect for simple navigation or teaser sections.
fi: Erittäin kompakti näyttö, joka näyttää vain osoitteet. Täydellinen yksinkertaiselle navigoinnille tai teaser-osiille.

source: If you prefer a visual interface, use the Gutenberg block instead of the shortcode. Perfect for users who aren't comfortable with code.
fi: Jos haluat visuaalisen käyttöliittymän, käytä Gutenberg-lohkoa lyhytkoodin sijaan. Täydellinen käyttäjille, jotka eivät ole mukavia koodin kanssa.

source: In the Block Editor, click the + button to add a new block
fi: Lohkoeditorissa klikkaa +-painiketta lisätäksesi uuden lohkon

source: Search for "Property Spotlight" in the block inserter
fi: Etsi "Näyteikkuna" lohkovalitsimesta

source: Use the block settings panel to configure all options visually
fi: Käytä lohkon asetuspaneelia kaikkien asetusten visuaaliseen määrittelyyn

source: The block provides the same options as the shortcode, but with a user-friendly interface. All settings are saved automatically.
fi: Lohko tarjoaa samat asetukset kuin lyhytkoodi, mutta käyttäjäystävällisellä käyttöliittymällä. Kaikki asetukset tallennetaan automaattisesti.

source: For theme developers: embed listings directly in PHP templates using WordPress's do_shortcode function. This is the recommended method for custom theme development.
fi: Teemakehittäjille: upota kohteet suoraan PHP-malleihin WordPressin do_shortcode-funktiolla. Tämä on suositeltu menetelmä mukautetulle teemakehitykselle.

source: Place this code in your theme's template files (e.g., front-page.php, page.php) where you want listings to appear.
fi: Aseta tämä koodi teemasi mallitiedostoihin (esim. front-page.php, page.php) sinne, missä haluat kohteiden näkyvän.

source: The plugin uses a BEM (Block Element Modifier) naming convention for CSS classes, making it easy to target specific elements for custom styling. All classes are prefixed with
fi: Lisäosa käyttää BEM (Block Element Modifier) -nimeämiskäytäntöä CSS-luokille, mikä helpottaa tiettyjen elementtien kohdistamista mukautettuun muotoiluun. Kaikki luokat alkavat etuliitteellä

source: to avoid conflicts with your theme.
fi: välttääksesi ristiriidat teemasi kanssa.

source: Add custom CSS in Appearance > Customize > Additional CSS, or in your theme's stylesheet. Here are the available classes:
fi: Lisää mukautettua CSS:ää Ulkoasu > Muokkaa > Lisä-CSS tai teemasi tyylitiedostoon. Tässä ovat saatavilla olevat luokat:

source: Main wrapper container. Use this to style the overall listing section (margins, padding, background).
fi: Pääsäiliö. Käytä tätä koko kohteiden osion muotoiluun (marginit, täytöt, tausta).

source: Applied when layout="grid". Use to customize grid-specific styling (gap, alignment).
fi: Käytetään, kun layout="grid". Käytä ruudukko-kohtaisen muotoilun mukauttamiseen (väli, tasaus).

source: Applied when layout="list". Use to customize vertical list spacing and layout.
fi: Käytetään, kun layout="list". Käytä pystylistan välistyksen ja asettelun mukauttamiseen.

source: Applied when layout="carousel". Use to customize slider navigation, arrows, and transitions.
fi: Käytetään, kun layout="carousel". Käytä liukusäätimen navigoinnin, nuolien ja siirtymien mukauttamiseen.

source: Individual listing card container. Perfect for customizing card appearance (borders, shadows, hover effects).
fi: Yksittäinen kohteen korttisäiliö. Täydellinen kortin ulkoasun mukauttamiseen (reunat, varjot, hover-efektit).

source: Image wrapper element. Use to customize image sizing, aspect ratio, or add overlay effects.
fi: Kuvasäiliöelementti. Käytä kuvan koon, kuvasuhteen mukauttamiseen tai päällyksen efektien lisäämiseen.

source: Content area containing text information. Use for typography, spacing, or background customization.
fi: Sisältöalue, joka sisältää tekstitiedot. Käytä typografian, välistyksen tai taustan mukauttamiseen.

source: Listing address/title element. Customize font size, weight, color, or add hover effects.
fi: Kohteen osoite/otsikkoelementti. Mukauta fonttikokoa, -painoa, -väriä tai lisää hover-efektejä.

source: Price display element. Perfect for highlighting prices with custom colors or typography.
fi: Hintanäyttöelementti. Täydellinen hintojen korostamiseen mukautetuilla väreillä tai typografialla.

source: Meta information container (rooms, area, property type). Use for styling secondary information.
fi: Metatietosäiliö (huoneet, pinta-ala, kiinteistötyyppi). Käytä toissijaisen tiedon muotoiluun.

source: Example CSS Customization
fi: Esimerkki CSS-mukautuksesta

source: Here's an example of customizing the listing cards:
fi: Tässä esimerkki kohteen korttien mukauttamisesta:

source: Tips & Best Practices
fi: Vinkit ja parhaat käytännöt

source: Performance
fi: Suorituskyky

source: Use the limit attribute to avoid loading too many listings at once. 3-6 listings is optimal for most pages.
fi: Käytä limit-attribuuttia välttääksesi liian monen kohteen lataamisen kerralla. 3-6 kohdetta on optimaalinen useimmille sivuille.

source: The plugin caches API responses automatically. Clear cache in Settings if listings don't update immediately.
fi: Lisäosa välimuistittaa API-vastaukset automaattisesti. Tyhjennä välimuisti Asetukset-välilehdeltä, jos kohteet eivät päivity heti.

source: Images are loaded lazily by default for better page load performance.
fi: Kuvat ladataan laiskasti oletusarvoisesti paremman sivun lataussuorituskyvyn vuoksi.

source: Design Recommendations
fi: Suunnittelusuositukset

source: Use 3 columns for desktop, 2 for tablets, and 1 for mobile. The plugin handles responsive breakpoints automatically.
fi: Käytä 3 saraketta työpöytäkäytössä, 2 tableteissa ja 1 mobiilissa. Lisäosa käsittelee responsiiviset katkaisupisteet automaattisesti.

source: Match your site's color scheme using the Style tab settings. Colors are applied via CSS variables.
fi: Sovita sivustosi värimaailma käyttämällä Tyyli-välilehden asetuksia. Värit sovelletaan CSS-muuttujien kautta.

source: Combine the title attribute with style="featured" for eye-catching section headers like "NÄYTEIKKUNA".
fi: Yhdistä title-attribuutti style="featured"-tyylin kanssa silmiinpistävien osion otsikoiden luomiseen kuten "NÄYTEIKKUNA".

source: Common Use Cases
fi: Yleiset käyttötapaukset

source: Homepage:
fi: Etusivu:

source: Use limit="3" with grid layout for a hero section showcasing your best properties.
fi: Käytä limit="3" ruudukkoasettelun kanssa pääosioon, joka esittelee parhaat kohteesi.

source: Sidebar:
fi: Sivupalkki:

source: Use layout="list" with show_image="false" for a compact, text-only widget.
fi: Käytä layout="list" show_image="false"-asetuksella kompaktin, tekstipainotteisen vimpaimen luomiseen.

source: Property Pages:
fi: Kiinteistösivut:

source: Use limit="4" with columns="2" to show related or similar properties.
fi: Käytä limit="4" columns="2"-asetuksia näyttääksesi liittyviä tai vastaavia kiinteistöjä.

source: Troubleshooting
fi: Vianetsintä

source: Listings not showing? Check that API credentials are configured in the Settings tab.
fi: Kohteet eivät näy? Tarkista, että API-tunnukset on määritetty Asetukset-välilehdellä.

source: Images missing? Verify that listings have images in the Linear.fi system.
fi: Kuvat puuttuvat? Varmista, että kohteilla on kuvia Linear.fi-järjestelmässä.

source: Styling issues? Use browser developer tools to inspect CSS classes and override as needed.
fi: Muotoiluongelmia? Käytä selaimen kehittäjätyökaluja tarkistaaksesi CSS-luokat ja ohittaaksesi tarvittaessa.

source: Shortcode not working? Ensure you're using square brackets [ ] not parentheses ( ).
fi: Lyhytkoodi ei toimi? Varmista, että käytät hakasulkeita [ ] eikä sulkeita ( ).

source: You do not have permission to access this page.
fi: Sinulla ei ole oikeutta käyttää tätä sivua.

source: Access Control
fi: Käyttöoikeudet

source: Control which users can manage featured listings. Administrators always have full access. Settings, Style, and API configuration remain admin-only.
fi: Hallitse, ketkä käyttäjät voivat hallita nostettuja kohteita. Ylläpitäjillä on aina täysi pääsy. Asetukset, Tyyli ja API-määritykset pysyvät vain ylläpitäjien käytettävissä.

source: Allowed Roles
fi: Sallitut roolit

source: Users with these roles can manage featured listings.
fi: Käyttäjät näillä rooleilla voivat hallita nostettuja kohteita.

source: Allowed Users
fi: Sallitut käyttäjät

source: Individual users who can manage featured listings (regardless of role).
fi: Yksittäiset käyttäjät, jotka voivat hallita nostettuja kohteita (roolista riippumatta).

source: Save Access Settings
fi: Tallenna käyttöoikeusasetukset

source: Access settings saved
fi: Käyttöoikeusasetukset tallennettu

source: Single Listing Pages
fi: Yksittäiset kohdesivut

source: Hide on single listing pages
fi: Piilota yksittäisen kohteen sivulla

source: Automatically hide the spotlight when viewing an individual property listing. Use this when the shortcode is on a page that also displays single listings.
fi: Piilota näyteikkuna automaattisesti yksittäisen kohteen sivulla. Käytä tätä, kun lyhytkoodi on sivulla, joka näyttää myös yksittäiset kohteet.

source: Hide on single listing
fi: Piilota yksittäisellä kohteella

source: Hide spotlight when viewing individual listings
fi: Piilota näyteikkuna yksittäisen kohteen sivulla

source: Use global setting
fi: Käytä yleistä asetusta

source: Always hide
fi: Piilota aina

source: Never hide
fi: Älä piilota

source: Hide spotlight on single listing pages. Useful when the shortcode is on a page that also displays individual listings.
fi: Piilota näyteikkuna yksittäisen kohteen sivulla. Hyödyllinen, kun lyhytkoodi on sivulla, joka näyttää myös yksittäiset kohteet.
